Table of Contents
 Class ConnectionLoadInfo
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Information about connection load update
[Serializable]
[DataContract]
public class ConnectionLoadInfo
Inheritance
object
ConnectionLoadInfo
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 BeamMapping
BeamMapping
public List<BeamLoadsImportMappingData> BeamMapping { get; set; }
Property Value
List<BeamLoadsImportMappingData>
 Description
Name of Weld
[DataMember]
public string Description { get; set; }
Property Value
string
 Edit this page